[
  {
    "title": "Artemis II Orion Stage Adapter Taking Shape",
    "body": "Three panels for the Artemis II Orion stage adapter were built by AMRO Fabricating Corp. in South El Monte, California and shipped to Marshall where engineers and technicians from NASA are joining them using a sophisticated friction-stir welding process to form the Orion stage adapter. This critical part of NASA’s Space Launch System (SLS) rocket will send the Artemis II crew into lunar orbit. AMRO also built panels for the Artemis II launch vehicle stage adapter also currently being built at Marshall and the SLS core stage and the Orion crew module built at NASA’s Michoud Assembly Facility in New Orleans. All panels where joined with the same friction-stir welding process. The Artemis I Orion stage adapter, also built at Marshall, has been delivered to Kennedy Space Center where it will be stacked with the rest of the SLS rocket components.  The adapter connects the Interim Cryogenic Propulsion Stage, the rocket’s upper stage that sends Orion to the Moon, to the Orion spacecraft. The Orion stage adapter has space for small payloads; on Artemis I it will transport 13 small satellites to deep space where they can study everything from asteroids to the Moon and radiation. SLS, the world’s most powerful rocket, along with NASA’s Orion spacecraft, will launch America into a new era of exploration to destinations beyond Earth’s orbit.",
    "img": "https://www.nasa.gov/sites/default/files/thumbnails/image/4755_msa_osa-2_vertical_weld_tool_1_large.png"
  },
  {
    "title": "Astronauts Check Suits Following Spacewalk",
    "body": "Spacesuit checks were on the schedule today for the Expedition 63 crew following a spacewalk to replace aging batteries on the International Space Station. The orbital residents also juggled a variety of science activities. NASA astronauts Chris Cassidy and Bob Behnken are back to work today after Wednesday’s spacewalk to swap batteries and route cables on the station’s Starboard-6 truss structure. The duo recharged batteries and refilled water tanks inside their U.S. spacesuits. Flight Engineer Doug Hurley also joined the pair in the afternoon for eye scans with an ultrasound device. All three astronauts called down to Mission Control today and briefed specialists with the results of the mission’s second spacewalk. Station managers will assess the orbital lab’s upgraded power status before scheduling more battery swap spacewalks later this month. Cassidy also configured cables on a specialized furnace before uploading new software to the high-temperature research device. Hurley worked with experiment hardware that seeks to better control the separation of blood cells and plasma to improve medical diagnostic devices. Cosmonauts Anatoly Ivanishin and Ivan Vagner partnered up Thursday morning for cardiac research. The duo is studying how the heart reacts to a unique suit that reverses the flow of blood towards the head caused by weightlessness. The pair then split up for life support maintenance and radiation checks.",
    "img": "https://blogs.nasa.gov/spacestation/wp-content/uploads/sites/240/2020/07/blog_iss063e034203.jpg"
  },
  {
    "title": "U.S. Black Engineer Information Technology & NASA News",
    "body": "The U.S. Black Engineer Information Technology magazine, sponsor of the annual Black Engineer of the Year Award (BEYA) and Women of Color Conferences, has posted an article regarding NASA’s decision to name its Headquarters building after the Agency’s first Black female Engineer, Mary W. Jackson. Ms. Jackson’s accomplishments are celebrated in Margot Lee Shetterly’s book, Hidden Figures: The American Dream and the Untold Story of the Black Women Mathematicians Who Helped Win the Space Race, and the movie that followed.",
    "img": "https://blogs.nasa.gov/odeo/wp-content/uploads/sites/285/2020/07/maryjackson-235x300.jpg"
  },
  {
    "title": "NASA Checks Out SLS Core Stage Avionics for Artemis I Mission",
    "body": "NASA completed  the second of eight tests in the Green Run test series at the agency’s Stennis Space Center near Bay St. Louis, Mississippi, where the Space Launch System rocket’s core stage is installed in the B-2 Test Stand. The avionics power on and checkout test steadily brought the core stage flight avionics hardware, which controls the rocket’s first eight minutes of flight, to life for the first time. The three flight computers and avionics are located in the forward skirt, the top section of the 212-foot tall core stage, with more avionics distributed in the core’s intertank and engine section.",
    "img": "https://www.nasa.gov/sites/default/files/avionics_slider_v2.jpg"
  }
]
